{"class_name": "Model", "backend": "tensorflow", "config": {"name": "model_1", "output_layers": [["avg_pool", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, null, null, 3], "dtype": "float32"}}, {"name": "block1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "block1_conv1", "padding": "valid", "filters": 32, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "kernel_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "block1_conv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"name": "block1_conv1_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "block1_conv1_act", "class_name": "Activation", "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]], "config": {"name": "block1_conv1_act", "trainable": true, "activation": "relu"}}, {"name": "block1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]], "config": {"name": "block1_conv2", "padding": "valid", "filters": 64, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "block1_conv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"name": "block1_conv2_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "block1_conv2_act", "class_name": "Activation", "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]], "config": {"name": "block1_conv2_act", "trainable": true, "activation": "relu"}}, {"name": "block2_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "config": {"name": "block2_sepconv1", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 128, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block2_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block2_sepconv1", 0, 0, {}]]], "config": {"name": "block2_sepconv1_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "block2_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block2_sepconv2_act", "trainable": true, "activation": "relu"}}, {"name": "block2_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]], "config": {"name": "block2_sepconv2", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 128, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block2_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block2_sepconv2", 0, 0, {}]]], "config": {"name": "block2_sepconv2_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "config": {"name": "conv2d_1", "padding": "same", "filters": 128, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "kernel_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "block2_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block2_pool", "strides": [2, 2], "padding": "same", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3]}}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"name": "batch_normalization_1", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "add_1", "class_name": "Add", "inbound_nodes": [[["block2_pool", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}}, {"name": "block3_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "block3_sepconv1_act", "trainable": true, "activation": "relu"}}, {"name": "block3_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]], "config": {"name": "block3_sepconv1", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 256, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block3_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block3_sepconv1", 0, 0, {}]]], "config": {"name": "block3_sepconv1_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "block3_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block3_sepconv2_act", "trainable": true, "activation": "relu"}}, {"name": "block3_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]], "config": {"name": "block3_sepconv2", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 256, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block3_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block3_sepconv2", 0, 0, {}]]], "config": {"name": "block3_sepconv2_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "conv2d_2", "padding": "same", "filters": 256, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "kernel_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "block3_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block3_pool", "strides": [2, 2], "padding": "same", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3]}}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"name": "batch_normalization_2", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "add_2", "class_name": "Add", "inbound_nodes": [[["block3_pool", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}}, {"name": "block4_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "block4_sepconv1_act", "trainable": true, "activation": "relu"}}, {"name": "block4_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block4_sepconv1_act", 0, 0, {}]]], "config": {"name": "block4_sepconv1", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block4_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block4_sepconv1", 0, 0, {}]]], "config": {"name": "block4_sepconv1_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "block4_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block4_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block4_sepconv2_act", "trainable": true, "activation": "relu"}}, {"name": "block4_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block4_sepconv2_act", 0, 0, {}]]], "config": {"name": "block4_sepconv2", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block4_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block4_sepconv2", 0, 0, {}]]], "config": {"name": "block4_sepconv2_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "conv2d_3", "padding": "same", "filters": 728, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "kernel_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "block4_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block4_pool", "strides": [2, 2], "padding": "same", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3]}}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "batch_normalization_3", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "add_3", "class_name": "Add", "inbound_nodes": [[["block4_pool", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}}, {"name": "block5_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "block5_sepconv1_act", "trainable": true, "activation": "relu"}}, {"name": "block5_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv1_act", 0, 0, {}]]], "config": {"name": "block5_sepconv1", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block5_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv1", 0, 0, {}]]], "config": {"name": "block5_sepconv1_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "block5_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block5_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block5_sepconv2_act", "trainable": true, "activation": "relu"}}, {"name": "block5_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv2_act", 0, 0, {}]]], "config": {"name": "block5_sepconv2", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block5_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv2", 0, 0, {}]]], "config": {"name": "block5_sepconv2_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "block5_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block5_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block5_sepconv3_act", "trainable": true, "activation": "relu"}}, {"name": "block5_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv3_act", 0, 0, {}]]], "config": {"name": "block5_sepconv3", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block5_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv3", 0, 0, {}]]], "config": {"name": "block5_sepconv3_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "add_4", "class_name": "Add", "inbound_nodes": [[["block5_sepconv3_bn", 0, 0, {}], ["add_3", 0, 0, {}]]], "config": {"name": "add_4", "trainable": true}}, {"name": "block6_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"name": "block6_sepconv1_act", "trainable": true, "activation": "relu"}}, {"name": "block6_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv1_act", 0, 0, {}]]], "config": {"name": "block6_sepconv1", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block6_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv1", 0, 0, {}]]], "config": {"name": "block6_sepconv1_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "block6_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block6_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block6_sepconv2_act", "trainable": true, "activation": "relu"}}, {"name": "block6_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv2_act", 0, 0, {}]]], "config": {"name": "block6_sepconv2", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block6_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv2", 0, 0, {}]]], "config": {"name": "block6_sepconv2_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "block6_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block6_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block6_sepconv3_act", "trainable": true, "activation": "relu"}}, {"name": "block6_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv3_act", 0, 0, {}]]], "config": {"name": "block6_sepconv3", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block6_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv3", 0, 0, {}]]], "config": {"name": "block6_sepconv3_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "add_5", "class_name": "Add", "inbound_nodes": [[["block6_sepconv3_bn", 0, 0, {}], ["add_4", 0, 0, {}]]], "config": {"name": "add_5", "trainable": true}}, {"name": "block7_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"name": "block7_sepconv1_act", "trainable": true, "activation": "relu"}}, {"name": "block7_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv1_act", 0, 0, {}]]], "config": {"name": "block7_sepconv1", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block7_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv1", 0, 0, {}]]], "config": {"name": "block7_sepconv1_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "block7_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block7_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block7_sepconv2_act", "trainable": true, "activation": "relu"}}, {"name": "block7_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv2_act", 0, 0, {}]]], "config": {"name": "block7_sepconv2", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block7_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv2", 0, 0, {}]]], "config": {"name": "block7_sepconv2_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "block7_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block7_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block7_sepconv3_act", "trainable": true, "activation": "relu"}}, {"name": "block7_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv3_act", 0, 0, {}]]], "config": {"name": "block7_sepconv3", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block7_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv3", 0, 0, {}]]], "config": {"name": "block7_sepconv3_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "add_6", "class_name": "Add", "inbound_nodes": [[["block7_sepconv3_bn", 0, 0, {}], ["add_5", 0, 0, {}]]], "config": {"name": "add_6", "trainable": true}}, {"name": "block8_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"name": "block8_sepconv1_act", "trainable": true, "activation": "relu"}}, {"name": "block8_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv1_act", 0, 0, {}]]], "config": {"name": "block8_sepconv1", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block8_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv1", 0, 0, {}]]], "config": {"name": "block8_sepconv1_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "block8_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block8_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block8_sepconv2_act", "trainable": true, "activation": "relu"}}, {"name": "block8_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv2_act", 0, 0, {}]]], "config": {"name": "block8_sepconv2", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block8_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv2", 0, 0, {}]]], "config": {"name": "block8_sepconv2_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "block8_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block8_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block8_sepconv3_act", "trainable": true, "activation": "relu"}}, {"name": "block8_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv3_act", 0, 0, {}]]], "config": {"name": "block8_sepconv3", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block8_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv3", 0, 0, {}]]], "config": {"name": "block8_sepconv3_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "add_7", "class_name": "Add", "inbound_nodes": [[["block8_sepconv3_bn", 0, 0, {}], ["add_6", 0, 0, {}]]], "config": {"name": "add_7", "trainable": true}}, {"name": "block9_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"name": "block9_sepconv1_act", "trainable": true, "activation": "relu"}}, {"name": "block9_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv1_act", 0, 0, {}]]], "config": {"name": "block9_sepconv1", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block9_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv1", 0, 0, {}]]], "config": {"name": "block9_sepconv1_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "block9_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block9_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block9_sepconv2_act", "trainable": true, "activation": "relu"}}, {"name": "block9_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv2_act", 0, 0, {}]]], "config": {"name": "block9_sepconv2", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block9_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv2", 0, 0, {}]]], "config": {"name": "block9_sepconv2_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "block9_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block9_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block9_sepconv3_act", "trainable": true, "activation": "relu"}}, {"name": "block9_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv3_act", 0, 0, {}]]], "config": {"name": "block9_sepconv3", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block9_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv3", 0, 0, {}]]], "config": {"name": "block9_sepconv3_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "add_8", "class_name": "Add", "inbound_nodes": [[["block9_sepconv3_bn", 0, 0, {}], ["add_7", 0, 0, {}]]], "config": {"name": "add_8", "trainable": true}}, {"name": "block10_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"name": "block10_sepconv1_act", "trainable": true, "activation": "relu"}}, {"name": "block10_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block10_sepconv1_act", 0, 0, {}]]], "config": {"name": "block10_sepconv1", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block10_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block10_sepconv1", 0, 0, {}]]], "config": {"name": "block10_sepconv1_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "block10_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block10_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block10_sepconv2_act", "trainable": true, "activation": "relu"}}, {"name": "block10_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block10_sepconv2_act", 0, 0, {}]]], "config": {"name": "block10_sepconv2", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": false, "pointwise_regularizer": null}}, {"name": "block10_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block10_sepconv2", 0, 0, {}]]], "config": {"name": "block10_sepconv2_bn", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "gamma_constraint": null}}, {"name": "block10_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block10_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block10_sepconv3_act", "trainable": true, "activation": "relu"}}, {"name": "block10_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block10_sepconv3_act", 0, 0, {}]]], "config": {"name": "block10_sepconv3", "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "pointwise_constraint": null, "dilation_rate": [1, 1], 